tests/artillery_script.yml
config:
  target: 'http://localhost:3001'  # URL вашего сервиса (замените на ваш фактический адрес)
  phases:
    - duration: 30   # Фаза 1: Первые 30 секунд - начало с 10 пользователей в секунду
      arrivalRate: 10
    - duration: 30   # Фаза 2: Следующие 30 секунд - увеличение до 100 пользователей в секунду
      arrivalRate: 100
    - duration: 30   # Фаза 3: Следующие 30 секунд - увеличение до 500 пользователей в секунду
      arrivalRate: 500
    - duration: 30   # Фаза 4: Последние 30 секунд - увеличение до 1000 пользователей в секунду
      arrivalRate: 1000

  http:
    pool: 200  # Максимальное количество одновременных подключений

scenarios:
  - flow:
      - post:
          url: "/image"